{
  "chapters": [
    {
      "chapter": 1,
      "title": "Pía",
      "text": "On a rainy afternoon, Pía had just finished her class with her group: Feli, Mía, Rochi, Delfi, Luli, Juana, More, Cami, and Jaz.\nSuddenly, a lightning bolt lit up the sky and—zap!—the power went out.\n—Girls, calm down! —said Pía—. It's just a blackout. We'll wait here until the lights come back.\nBut nobody seemed very calm."
    },
    {
      "chapter": 2,
      "title": "More and Feli",
      "text": "—Pichu! I lost my phone! —shouted More, digging through her backpack as if it was the end of the world.\nFeli looked up from her screen.\n— ¡NOO! I don't have the internet! I'm going to miss the new episode of my show!\n—More, relax. We'll look for it later, once we solve this.\nSuddenly, More pulled the phone out of her jacket pocket.\n—Oh my god, I'm so dumb, Pichu—it was here the whole time!\n—Perfect, one problem solved."
    },
    {
      "chapter": 3,
      "title": "Mía, Rochi, and Delfi",
      "text": "Mía, Rochi, and Delfi ran toward Pía, pale-faced.\n—Pichu! We tried to get out of the school to see what was happening outside, but the door was locked! We can't open it! — said Rochi\n—No way! We have OMA, we need to go! —cried Mía.\n—And it's super important —added Delfi.\nDelfi nodded, checking her watch with a worried face.\nPía thought quickly.\n—What time is it?\n—Five o'clock —said Delfi.\n—Then we've got time. Meanwhile, how about we solve the hardest problem of all?\n—Which one? —asked Rochi.\n—Getting out of school —Pía said, smiling.\nRochi immediately began to plan: measuring, observing, calculating...\nDelfi took notes seriously, as if it were a test.\nMía just prayed the Wi-Fi on her calculator wouldn't go out."
    },
    {
      "chapter": 4,
      "title": "Luli",
      "text": "Luli looked defeated.\n—Pichu, I have a football match today. It's the final.\nPía looked at her sympathetically. Calm down, Luli, we're getting out. No one's left behind.\nLuli took a deep breath, as if she were about to kick a penalty."
    },
    {
      "chapter": 5,
      "title": "Juana",
      "text": "Juana walked up, eyes full of tears.\n—Pichu… I have my dance competition today.\nPía hugged her.\n—We'll get out, Jua. And when you win, I want an invitation, deal?\nJuana smiled faintly.\n—Deal."
    },
    {
      "chapter": 6,
      "title": "Cami",
      "text": "A loud noise made everyone turn around.\nCami was on the floor, holding her chest.\n—I can't… —she whispered.\n—She's asthmatic! —shouted Luli.\nPía rushed to her backpack, grabbed the inhaler, and handed it to her.\nCami breathed once, twice, and color returned to her face.\n—Thanks, Pichu —she said between breaths.\n—Just breathe. Nobody panic —said Pía."
    },
    {
      "chapter": 7,
      "title": "The Escape Plan",
      "text": "Delfi studied the lock carefully.\n—If the problem's electrical, maybe the magnetic system just got stuck —she said.\n—Can you fix it? —asked Rochi.\n—With a plastic ruler and a paperclip… maybe —answered Delfi.\n—I'll light it for you with my phone —said Rochi.\nTogether, they managed to make the lock click faintly.\nPía pushed—and the door opened.\nEveryone screamed with joy."
    },
    {
      "chapter": 8,
      "title": "Jaz",
      "text": "They all ran outside, where their parents were waiting.\nMía's dad ran up.\n—Pía! Jaz is missing! She didn't come out with the others!\nPía froze. She opened the principal's laptop and checked the cameras.\nThere she was—Jaz, calmly sitting in the bathroom, headphones on, completely oblivious to everything.\n—What happened, Pía? I was just here checking what to buy on Shein.\n—Always so spaced out, Jaz! —said Pía, half laughing, half exhausted."
    },
    {
      "chapter": "Epilogue",
      "title": "Pía",
      "text": "With everyone safe, Pía looked at the empty classroom.\nWhat happened that day made her reflect. She'd been planning to retire next year, but now she wasn't so sure. She realized the girls wouldn't survive without her—and, secretly, she wouldn't survive without them either.\nThe next day, everything went back to normal.\nPía entered the classroom, looked at the girls, and smiled:\n—Well, ladies, ready to keep working on python functions?"
    }
  ]
}
